Revit 2026 API
RenderingSettings Class
 Represents the rendering settings for a 3d view.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderingSettings
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class RenderingSettings : IDisposable
Public Class RenderingSettings
	Implements IDisposable
public ref class RenderingSettings : IDisposable
type RenderingSettings =
    class
        interface IDisposable
    end
The RenderingSettings type exposes the following members.
Properties
Name | Description
BackgroundStyle |  The enum value that controls the background style for rendering.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
LightingSource |  The lighting scheme type.
PrinterResolution |  The resolution level when using printer.
ResolutionTarget |  The resolution target.
ResolutionValue |  The rendering resolution in dots per inch (DPI).
UsesRegionRendering |  The bool value that indicates whether to use region rendering.
Top
Methods
Name | Description
Dispose | Releases all resources used by the RenderingSettings
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetBackgroundSettings |  Returns an object that represents the rendering background settings.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetRenderingImageExposureSettings |  Returns an object that represents the rendering image exposure settings.
GetRenderingQualitySettings |  Returns an object that represents the rendering quality settings.
GetRenderingRegionOutline |  Returns the outline of the rendering region.
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetBackgroundSettings |  Changes the rendering background settings details for the current background style.
SetRenderingImageExposureSettings |  Changes the rendering image exposure settings.
SetRenderingQualitySettings |  Change rendering quality settings.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace